Repository: manatools/dnfdragora
Catalog: po/*.po
Languages: it

source: %(prog)s [options]
it: %(prog)s [opzioni]

source: start using yui GTK+ plugin implementation
it: lanciare usando il plugin GTK+ di yui

source: start using yui ncurses plugin implementation
it: lanciare usando il plugin ncurses di yui

source: start using yui Qt plugin implementation
it: lanciare usando il plugin Qt di yui

source: use full screen for dialogs
it: usa la dialog a schermo intero

source: force a new path for group icons (instead of /usr/share/icons)
it: forza un nuovo percorso per le icone dei gruppi (invece di /usr/share/icons)

source: force a new path for all the needed images (instead of /usr/share/dnfdragora/images)
it: forza un nuovo percorso per tutte le immagini necessarie (invece di /usr/share/dnfdragora/images)

source: directory containing localization strings (developer only)
it: directory contenente le stringhe di localizzazione (solo per sviluppatori)

source: install packages
it: installa pacchetti

source: show updates only dialog
it: mostra la dialog degli aggiornamenti

source: show application version and exit
it: mostra la versione dell'applicazione e termina

source: force dnfdaemon dbus services used by dnfdragora to exit
it: forza il servizio dbus di dnfdaemon usato da dnfdragora a terminare

source: dnfdaemon client failure [%s]
it: Client dnfdaemon fallito [%s]

source: Try again using a login shell (i.e. "su -")
it: Prova nuovamente usando una shell di login (es. con "su -")

source: %(prog)s %(NL)sversion: %(version)s%(NL)ssite: %(site)s
it: %(prog)s %(NL)sversione: %(version)s%(NL)ssito: %(site)s

source: Sorry
it: Spiacente

source: dnfdaemon client error occurred:%(NL)s%(error)s
it: Errore del client dnfdaemon:%(NL)s%(error)s

source: dnfdaemon name error occurred:%(NL)s%(error)s
it: Errore nei nomi di dnfdaemon:%(NL)s%(error)s

source: dnfdaemon attribute error occurred:%(NL)s%(error)s
it: Errore attributo di dnfdaemon:%(NL)s%(error)s

source: dnfdaemon type error occurred:%(NL)s%(error)s
it: Errore di tipo di dnfdaemon:%(NL)s%(error)s

source: Error occurred:%(NL)s%(error)s
it: Errore:%(NL)s%(error)s

source: force a new path for all the needed icons (instead of /usr/share/icons/hicolor/128x128/apps/)
it: forza un nuovo percorso per tutte le icone necessarie (invece di /usr/share/icons/hicolor/128x128/apps/)

source: KDE Desktop
it: Desktop KDE

source: Xfce Desktop
it: Desktop Xfce

source: Applications
it: Applicazioni

source: LXDE Desktop
it: Desktop LXDE

source: LXQt Desktop
it: Desktop LXQt

source: Cinnamon Desktop
it: Desktop Cinnamon

source: MATE Desktop
it: Desktop MATE

source: Hawaii Desktop
it: Desktop Hawaii

source: Sugar Desktop Environment
it: Ambiente Desktop Sugar

source: GNOME Desktop
it: Desktop Gmome

source: Development
it: Sviluppo

source: Servers
it: Server

source: Base System
it: Sistema Base

source: Content
it: Contenuto

source: All
it: Tutti

source: Empty
it: Vuoto

source: Search result
it: Risultato della ricerca

source: Uncategorized
it: Senza categoria

source: Getting installed packages
it: Ottenendo pacchetti installati

source: Getting available packages
it: Ottenendo pacchetti disponibili

source: Getting available updates
it: Ottenendo gli aggiornamenti disponibili

source: Getting all packages
it: Ottenendo tutti i pacchetti

source: Updated packages
it: Pacchetti aggiornati

source: Downgraded packages
it: Pacchetti revertiti

source: Obsoleting packages
it: Pacchetti in obsoloscenza

source: Obsoleted packages
it: Pacchetti obsoleti

source: Erased packages
it: Pacchetti cancellati

source: Installed packages
it: Pacchetti installati

source: Installed for dependencies
it: Installati per dipendenze

source: Reinstalled packages
it: Pacchetti reinstallati

source: Installing
it: Installando

source: Updating
it: Aggiornando

source: Removing
it: Rimuovendo

source: Downgrading
it: Revertendo

source: Replacing
it: Rimpiazzando

source: Updating: %s
it: Aggiornando: %s

source: Updated: %s
it: Aggiornato(i): %s

source: Installing: %s
it: Installando: %s

source: Reinstalling: %s
it: Reinstallando: %s

source: Reinstalled: %s
it: Reinstallato: %s

source: Cleanup: %s
it: Pulito(i): %s

source: Removing: %s
it: Rimuovendo: %s

source: Obsoleting: %s
it: Marcando come obsoleto(i): %s

source: Obsoleted: %s
it: Obsoleto(i): %s

source: Downgrading: %s
it: Revertendo: %s

source: Downgraded: %s
it: Revertito(i): %s

source: Verifying: %s
it: Verificando: %s

source: Running scriptlet: %s
it: Eseguendo scriptlet: %s

source: Preparing transaction: %s
it: Preparando la transazione: %s

source: Post-transaction script: %s
it: Script post-transazione: %s

source: Bugfix
it: Correzione bug

source: New Package
it: Nuovo poacchetto

source: Security
it: Sicurezza

source: Enhancement
it: Miglioramento

source: Undo transaction
it: Annulla transazione

source: Error checking package signatures
it: Errore nel controllo di firma del pacchetto

source: Downloading error
it: Errore di download

source: Error in transaction
it: Errore nella transazione

source: Build transaction failure
it: Fallita la costruzione della transazione

source: dnfdaemon client not authorized:%(NL)s%(error)s
it: Client dnfdaemon non autorizzato:%(NL)s%(error)s

source: History
it: Storia

source: History (Date/Time)
it: Storia (Data/Ora)

source: Transaction History
it: Storia delle transazioni

source: &Undo
it: &Scarta

source: &Close
it: &Chiudi

source: Transaction result
it: Risultato della transazione

source: Transaction dependency
it: Dipendenze della transazione

source: &Cancel
it: &Annulla

source: replacing
it: rimpiazzando

source: Total size
it: Dimensione totale

source: Developers
it: Sviluppatori

source: dnfdragora is a DNF frontend that works using GTK, ncurses and QT
it: dnfdragora è un fron-tend per DNF che funziona con le librerie Gtk, ncurses e Qt

source: Bandwidth
it: Larghezza di banda

source: Base cache dir
it: directory cache base

source: Base URL
it: URL base

source: Cost
it: Costo

source: DeltaRPM percentage
it: Percentuale DeltaRPM

source: Enabled
it: Abilitato

source: Enabled metadata
it: Metadata abilitati

source: Enable groups
it: Abilita i gruppi

source: Exclude
it: Escludi

source: Exclude packages
it: Escludi pacchetti

source: Failover method
it: Metodo della tolleranza al fallimento

source: Fastest mirror
it: Mirror più veloce

source: GPG check
it: Controllo GPG

source: GPG key
it: Chiave GPG

source: Include packages
it: Include i pacchetti

source: IP resolve
it: Risoluzione IP

source: Max parallel download
it: Numero massimo di dowload paralleli

source: Media ID
it: ID media

source: Metadata expire
it: Scadenza dei meta-dati

source: Meta link
it: Link Meta

source: Min rate
it: Tasso minimo

source: Mirror list
it: List dei mirror

source: Name
it: Nome

source: Packages
it: Pacchetti

source: Priority
it: Priorità

source: Protected packages
it: Pacchetti protetti

source: Proxy password
it: Password del proxy

source: Proxy username
it: Utente del proxy

source: Repo GPG check
it: Controllo GPG del repo

source: Retries
it: Tentativi

source: Size
it: Dimensione

source: Skip if unavailable
it: Scarta se non disponibile

source: SSL CA cert
it: Certificato SSL CA

source: SSL client cert
it: Certificato client SSL

source: SSL client key
it: Chiave cliente SSL

source: SSL verify
it: Verifica SSL

source: Throttle
it: Acceleratore

source: Type
it: Tipo

source: Username
it: Utente

source: Repository Management
it: Gestione repository

source: Information
it: Informazioni

source: Value
it: Valore

source: &Apply
it: &Applica

source: Never
it: Mai

source: %s second(s)
it: %s secondo(i)

source: Now
it: Ora

source: System
it: Sistema

source: Search
it: Ricerca

source: Logging
it: Scrivendo nel log

source: Restore &default
it: Ripristina i valori di &default

source: System options
it: Opzioni di sistema

source: Run transactions on packages automatically without confirmation needed
it: Esegui le transazioni sui pacchetti automaticamente senza chiedere conferma

source: Hide dnfdragora-update menu if there are no updates
it: Nascondi il menu di dnfdragora-update se non ci sono aggiornamenti

source: Interval to check for updates (minutes)
it: Intervallo per il controllo degli aggiornamenti (in minuti)

source: Metadata expire time (hours)
it: Tempo scadenza dei meta-dati (in ore)

source: Layout options (active at next startup)
it: Opzioni di layout (attivo dopo il riavvio dell'applicazione)

source: Show updates
it: Mostra gli aggiornamenti

source: Do not show groups view
it: Non mostrare la vista per gruppi

source: Search options
it: Opzioni di ricerca

source: Show newest packages only
it: Mostra solo i pacchetti nuovi

source: Match all words
it: Corrispondenza di tutte le parole

source: Logging options (active at next startup)
it: Opzioni di Log (attive dopo il riavvio dell'applicazione)

source: Enable logging
it: Abilita il log

source: Change &directory
it: Cambia la &directory

source: Debug level
it: Livello di debug

source: Choose log destination directory
it: Scegli la cartella di destinazione del log

source: &Yes
it: &Sì

source: Do you want to import this GPG key <br>needed to verify the %(pkg)s package?<br><br>Key : 0x%(id)s:<br>Userid : "%(user)s"<br>From : %(file)s
it: Vuoi importare questa chiave GPG <br>necessaria per verificare il pacchetto %(pkg)s?<br><br>Chiave : 0x%(id)s:<br>ID utente : "%(user)s"<br>Da : %(file)s

source: GPG key missed
it: Chiave GPG mancante

source: dnfdaemon api version : %(actual)d doesn't match needed api version : %(required)d
it: La versione delle API dnfdaemon : %(actual)d non corrisponde è necessaria la versione dell API : %(required)d

source: package has not any %s attributes
it: il pacchetto non ha nessun attributo %s

source: Caching groups from packages...
it: Creando la cache dei gruppi dai pacchetti...

source: Command in progress
it: Comando in esecuzione

source: Accessibility
it: Accessibilità

source: Archiving
it: Archiviazione

source: Cd burning
it: Masterizzazione

source: Compression
it: Compressione

source: Other
it: Altro

source: Communications
it: Comunicazioni

source: Bluetooth
it: Dispositivi bluetooth

source: Serial
it: Seriale

source: Telephony
it: Telefonia

source: Databases
it: Database

source: GNOME and GTK+
it: GNOME e GTK+

source: KDE and Qt
it: KDE e QT

source: Tools
it: Strumenti

source: Documentation
it: Documentazione

source: Editors
it: Editor

source: Education
it: Istruzione

source: Emulators
it: Emulatori

source: File tools
it: Gestione file

source: Games
it: Giochi

source: Adventure
it: Avventure

source: Boards
it: Giochi da tavolo

source: Cards
it: Carte

source: Puzzles
it: Rompicapo

source: Shooter
it: Sparatutto

source: Simulation
it: Simulazione

source: Sports
it: Sport

source: Strategy
it: Strategia

source: Geography
it: Geografia

source: Graphical desktop
it: Desktop grafico

source: Graphics
it: Grafica

source: Editors and Converters
it: Redattori e Convertitori

source: Utilities
it: Utilità

source: Photography
it: Fotografia

source: Scanning
it: Analizzando

source: Viewers
it: Visualizzatori

source: Monitoring
it: Monitoraggio

source: Networking
it: Rete

source: File transfer
it: Trasferimento file

source: Instant messaging
it: Messaggistica istantanea

source: Mail
it: Posta

source: News
it: Notizie

source: Remote access
it: Accesso remoto

source: Office
it: Ufficio

source: Dictionary
it: Dizionario

source: Finance
it: Finanza

source: Management
it: Gestione

source: Organizer
it: Organizzatore

source: Spreadsheet
it: Foglio di calcolo

source: Word processor
it: Elaboratore di testi

source: Publishing
it: Editoria

source: Sciences
it: Scienze

source: Astronomy
it: Astronomia

source: Biology
it: Biologia

source: Chemistry
it: Chimica

source: Computer science
it: Informatica

source: Geosciences
it: Scienze della Terra

source: Mathematics
it: Matematica

source: Physics
it: Fisica

source: Shells
it: Shell

source: Sound
it: Audio

source: Players
it: Lettori multimediali

source: Boot and Init
it: Boot e init

source: Configuration
it: Configurazione

source: Fonts
it: Font

source: X11 bitmap
it: Bitmap X11

source: Internationalization
it: Localizzazione

source: Kernel and hardware
it: Kernel e hardware

source: Libraries
it: Librerie

source: Printing
it: Stampa

source: Terminals
it: Terminali

source: Text tools
it: Strumenti per testi

source: Toys
it: Giochini

source: Television
it: Televisione

source: Workstation
it: Postazione di lavoro

source: Console Tools
it: Programmi da riga di comando

source: Game station
it: Computer per giocare

source: Internet station
it: Postazione Internet

source: Multimedia station
it: Postazione multimediale

source: Network Computer (client)
it: Computer in rete (client)

source: Office Workstation
it: Postazione per lavoro da ufficio

source: Scientific Workstation
it: Postazione di lavoro scientifica

source: Graphical Environment
it: Ambiente grafico

source: GNOME Workstation
it: Postazione di lavoro grafica con GNOME

source: IceWm Desktop
it: Desktop IceWm

source: KDE Workstation
it: Postazione di lavoro grafica con KDE

source: Other Graphical Desktops
it: Altri desktop grafici

source: Network Computer server
it: Server di rete

source: Go to index
it: Vai all'indice

source: Menu line
it: Linea del menu

source: Filters and search line
it: Linea dei filtri e della ricerca

source: Group panel
it: Pannello dei gruppi

source: Package panel
it: Pannello dei pacchetti

source: Information panel
it: Pannello delle informazioni

source: Progress bar line
it: Linea della barra di progresso

source: Button line
it: Linea dei pulsanti

source: File menu
it: Menù File

source: Information menu
it: Menù Informazioni

source: Options menu
it: Menù Opzioni

source: Help menu
it: Menù Help

source: dnfdragora is a DNF frontend, based on Mageia rpmdragora layout and Fedora yumex-dnf interaction with dnfdaemon.<br><br>
it: dnfdragora è un fron-tend per DNF, basato sul layout del programma di Mageia rpmdragora e sul programma di Fedora yumex-dnf per l'interazione con dnfdaemon.<br><br>

source: dnfdragora is basically a package manager user interface that allows to install, update, remove, search packages and more.<br><br>
it: dnfdragora è fondamentalmente un'interfaccia utente per la gestione dei pacchetti che consente di installare, aggiornare, rimuovere, cercare pacchetti e altro ancora.<br><br>

source: dnfdragora is part of manatools and it is based on libyui so that it can work using Gtk, Qt or ncurses, i.e. both graphical and textual user interfaces.<br><br>
it: dnfdragora fa parte del progetto manatools e si basa sulla libreria libyui che gli permette di lavorare usando le librerie Gtk, Qt o ncurses, cioè entrambe le interfacce utente grafica e testuale.<br><br>

source: dnfdragora window is comprised of:
it: La finestra di dnfdragora è composta di:

source: Menu bar content
it: Contenuto della barra dei menù

source: Menu bar contains dnfdragora drop down menus:
it: La barra dei menù contiene i menù a tendina di dnfdragora:

source: File Menu
it: Menù File

source: <h2>Reset selection</h2>
it: <h2>Pulisci la selezione</h2>

source: This menu removes any flags on packages, if any packages have been selected for installation or removal they will be back to previous status.<br>
it: Questo menù rimuove tutti le spunte sui pacchetti, se ci sono pacchetti selezionati per essere installati o rimossi, saranno riportati al loro stato precedente.<br>

source: <h2>Refresh metadata</h2>
it: <h2>Rinfresca i meta-dati</h2>

source: This menu send a request to dnfdaemon to force a refresh of all the meta data. This action is asynchronous and requires to rebuild package information cache.<br>
it: Questo menù manda una richiesta a dnfdaemon per forzare l'aggiornamento di tutti i meta-dati. Questa azione è asincrona e richiede la rigenerazione della cache delle informazioni dei pacchetti.<br>

source: <h2>Repositories</h2>
it: <h2>Repository</h2>

source: This menu opens a dialog that allows to enable or disable repositories. Any changes are valid for the time dnfdragora is running and it is not permanent.<br>
it: Questo menù apre una finestra di dialog che permette di abilitare o disabilitare i repository. Tutti i cambiamenti sono validi per il tempo in cui dnfdragora è in esecuzione e non sono permanenti.<br>

source: <h2>Quit</h2>
it: <h2>Termina</h2>

source: This menu exits from dnfdragora.<br>
it: Questo menù termina dnfdragora.<br>

source: Information Menu
it: Menù informazioni

source: <h2>History</h2>
it: <h2>Storia</h2>

source: This menu runs a dialog containing transaction history shown in a tree ordered by date. Selected history can be undone by pressing <b>Undo</b> button.<br>
it: Questo menù apre una finestra di dialogo contenente la storia delle transazioni mostrate ad albero ed ordinate per data. La storia selezionata può essere scartata premendo il pulsante <b>Scarta</b>.<br>

source: <br><i>Note that this function is currently broken because of dnf API change</i><br>
it: <br><i>Notare che questa funzionalità non è attualmente funzionante perché le API di DNF sono cambiate</i><br>

source: Option Menu
it: Menù Opzioni

source: <h2>User preferences</h2>
it: <h2>Preferenze utente</h2>

source: This menu opens a %s containing user settings to customize dnfdragora behavior.<br>
it: Questo menù apre una %s contenente le impostazioni dell'utente per personalizzare il comportamento di dnfdragora.<br>

source: dialog
it: finestra di dialogo

source: dnfdragora options
it: Opzioni dnfdragora

source: This dialog allows to customize dnfdragora behavior by changing options. Some changes are available after closing the dialog, others need a dnfdragora restart.<br><br>
it: Questa finestra di dialogo permette di personalizzare il comportamento di dnfdragora cambiando le opzioni. Alcune modifiche saranno disponibili alla chiusura della finestra, altre rendono necessario il riavvio di dnfdragora.<br><br>

source: <h2>System options</h2>
it: <h2>Opzioni di sistema</h2>

source: <ul><li><b>Run transactions on packages automatically without confirmation needed</b>: if checked transactions do not need to be confirmed, dnfdragora works as answering always <i>yes</i>.
it: <ul><li><b>Esegue le transazioni sui pacchetti automaticamente senza bisogno di conferma</b>: se selezionata le transazioni non necessitano di conferma e dnfdragora funziona rispondendo sempre <i>sì</i>.

source: <br><b>NOTE</b> that this option means that also removing packages is silently accepted</li>
it: <br><b>NOTARE</b> che questa opzione significa che anche la rimozione dei pacchetti è implicitamente accettata</li>

source: <li><b>Interval to check for updates</b>: the given number represents when dnfdragora needs to check for updates, value is expressed in minutes</li>
it: <li><b>Intervallo di tempo per controllare gli aggiornamenti</b>: il numero impostato rappresenta quando dnfdragora deve controllare gli aggiornamenti, il valore è rappresentato in minuti</li>

source: <li><b>Metadata expire time</b>: time to force Metadata expiration, the value is expressed in hours</li></ul>
it: <li><b>Scadenza meta-dati</b>: tempo per forzare la scadenza dei meta-dati, il valore è rappresentato in ore</li></ul>

source: <h2>Layout options</h2>
it: <h2>Opzioni di layout</h2>

source: <ul><li><b>Show updates</b>: if checked dnfdragora starts with <i>updates</i> filter active, i.e. showing only package available for updates if any.</li>
it: <ul><li><b>Mostra gli aggiornamenti</b>: se selezionata dnfdragora partirà con il filtro <i>aggiornamenti</i> attivo, ovvero mostrando solo i pacchetti disponibili per gli aggiornamenti, se presenti.</li>

source: <li><b>Do not show groups view</b>: filtering by groups could require CPU if using comps, if this option is checked dnfdragora starts showing all packages.</li></ul>
it: <li><b>Non mostrare la vista a gruppi</b>: Il filtro per gruppi può richiedere CPU se si sta usando comps, se questa opzione è selezionata dnfdragora parte mostrando tutti i pacchetti.</li></ul>

source: <b>NOTE</b> that the above options require dnfdragora to be restarted.
it: <b>NOTARE</b> che le suddette opzioni necessitano che dnfdragora sia riavviato.

source: <h2>Search options</h2>
it: <h2>Opzioni di ricerca</h2>

source: <ul><li><b>Show newest packages only</b>: if checked dnfdragora shows only newest packages on search. <i>Note that is valid if searches are not performed by using regular expressions</i></li>
it: <ul><li><b>Mostra solo i pacchetti più recenti</b>: se questa opzione è selezionata dnfdragora mostra solo i pacchetti più recenti nelle ricerche. <i>Notare che questa opzione è valida solo se le ricerche non vengono eseguite utilizzando le espressioni regolari</i></li>

source: <li><b>Match all words</b>: if checked a search without using regular expressions will match all the given words into the text field.</li></ul>
it: <li><b>Abbina tutte le parole</b>: se questa opzione è selezionata una ricerca senza usare le espressioni regolari abbinerà tutte le parole inserite nel campo di testo.</li></ul>

source: <h2>Logging options</h2>
it: <h2>Opzioni di log</h2>

source: Enable these options to let dnfdragora log on file called <i>dnfdragora.log</i>.
it: Abilita queste opzioni per permettere a dnfdragora di scrivere su un file di log chiamato <i>dnfdragora.log</i>.

source: <ul><li><b>Change directory</b>: this option allows to set logging directory, directory must exist and needs write permission.</li>
it: <ul><li><b>Cambia la directory</b>: questa opzione permette di impostare la cartella di log, questa directory deve esistere ed avere permessi di scrittura.</li>

source: <li><b>Debug level</b>: if checked log verbose logging is enabled.</li></ul>
it: <li><b>Livello di debug</b>: se questa opzione è selezionata viene abilitato l'opzione di log prolisso.</li></ul>

source: Help Menu
it: Menù Help

source: <h2>Manual</h2>
it: <h2>Manuale</h2>

source: This menu opens dnfdragora help dialog.
it: Questo menù apre la finestra di help di dnfdragora.

source: <h2>About</h2>
it: <h2>Informazioni su</h2>

source: This menu opens dnfdragora about dialog.
it: Questo menù apre la finestra di informazioni su dnfdragora.

source: Views and search
it: Viste e ricerca

source: <h2>Views</h2>
it: <h2>Viste</h2>

source: First combobox allows to show packages by groups. If <i>Groups</i> is selected group panel shows a tree view containing groups, while selecting a group shows related packages into package panel.
it: La prima combobox permette di mostrare i pacchetti per gruppi. Se <i>Gruppi</i> è selezionata il pannello mostra un albero contenente tutti i gruppi, mentre selezionando un gruppo nel pannello dei pacchetti sono mostrati tutti i pacchetti relativi al gruppo.

source: If <i>All</i> is selected, package panel contains all the packages.
it: Se <i>Tutti</i> è selezionata, il pannello dei pacchetti contiene tutti i pacchetti.

source: <h2>Filters</h2>
it: <h2>Filtri</h2>

source: Filter combobox allows to filter packages shown into package panel by:
it: La combobox dei filtri permette di filtrare i pacchetti mostrati nel pannello dei pacchetti per:

source: <ul><li><b>Installed</b>: shows installed packages only.</li>
it: <ul><li><b>Installati</b>: mostra solo i pacchetti installati.</li>

source: <li><b>Not installed</b>: shows available packages only.</li>
it: <ul><li><b>Non installati</b>: mostra solo i pacchetti disponibili.</li>

source: <li><b>To update</b>: shows packages that are available for updates only.</li>
it: <ul><li><b>Da aggiornare</b>: mostra solo i pacchetti disponibili per l'aggiornamento.</li>
