Repository: manatools/dnfdragora
Catalog: po/*.po
Languages: it

source: <li><b>Show x86_64 and noarch only</b>: if dnfdragora is running on x86_64 architecture, it hides i686 packages.</li>
it: <li><b>Mostra solo x86_64 e noarch</b>: se dnfdragora sta funzionando su un architettura x86_64 nasconderà pacchetti per i686.</li>

source: <li><b>All</b>: shows all the packages, i.e. available, updates and installed.</li></ul>
it: <li><b>Tutti</b>: mostra tutti i pacchetti, ovvero disponibili, aggiornamenti ed installati.</li></ul>

source: <h2>Search</h2>
it: <h2>Ricerca</h2>

source: Search is performed by pressing <i>Search</i> button if text field is filled. Search combobox allows to search given text into package <i>names</i>, <i>summaries</i>, <i>descriptions</i> or <i>files</i>.
it: La ricerca viene effettuata premendo il pulsante <i>Ricerca</i> se il relativo campo di testo è riempito. La combobox di ricerca permette di cercare il testo passato dentro a <i>nome</i>, <i>sommario</i>, <i>descrizione</i> o <i>file</i> dei pacchetti.

source: A special checkbox <i>Use regexp</i> is used to look for packages by python language regular expressions. This search is performed on cached package information such as for the <b>only names and summaries</b>.
it: Una opzione speciale <i>Utilizza regexp</i> è usata per cercare i pacchetti tramite le espressioni regolari di python. Questa ricerca è effettuata sulle informazioni dei pacchetti contenute nella cache come ovvero <b>solo i nomi ed i sommari</b>.

source: <i>Note</i> that if regular expressions are used to search by names full package filename with version is used.
it: <i>Notare</i> che se le espressioni regolari sono usate per cercare nei nomi verranno usati i nomi completi dei pacchetti comprensivi di versione e nome.

source: The <i>Clear search</i> button resets search text field.
it: Il pulsante <i>Pulisci la ricerca</i> resetta il campo di testo della ricerca.

source: This panel shows all the groups to be used to filter packages by group, if view groups is selected. Special group <i>Search</i> is added if a search is performed.
it: Questo pannello mostra tutti i gruppi usati per filtrare i pacchetti per gruppo, se la vista per gruppi è selezionata. Un gruppo speciale <i>Ricerca</i> viene aggiunto se una ricerca viene effettuata.

source: This panel shows all the filtered packages with they basic information such as <i>name</i>, <i>summary</i>, <i>version</i>, <i>release</i>, <i>architecture</i>, <i>size</i>, and <i>status</i>.
it: Questo pannello mostra tutti i pacchetti filtrati con le loro informazioni di base come <i>nome</i>, <i>sommario</i>, <i>versione</i>, <i>release</i>, <i>architettura</i>, <i>dimensione</i> e <i>stato</i>.

source: A checkbox for any packages is available to add related package to transaction for installing, updating or removing.
it: Per ogni pacchetto è presente un'opzione di spunta che permette di aggiungere il pacchetto in questione alla transazione per essere installato, aggiornato o rimosso.

source: This panel shows all the package information such as <i>description</i>, <i>URL</i>, <i>repository</i>, <i>requirements</i>, <i>file list</i>, and <i>changelog</i>.
it: Questo pannello mostra tutte le informazioni del pacchetto come <i>descrizione</i>, <i>URL</i>, <i>repository</i>, <i>requisiti</i>, <i>lista file</i>e <i>changelog</i>.

source: <br><br><i>Note that changelog is not provided by dnfdaemon at the moment.</i>
it: <br><br><i>Notare che le informazioni di changelog non sono fornite da dnfdaemon in questo momento.</i>

source: Progress bar
it: Barra progresso

source: Progress bar shows dnfdragora operations progression such as transactions and caching data.
it: La barra progresso mostra la progressione delle operazioni di dnfdragora, quali le transazioni e il caching dei dati.

source: Buttons line
it: Linea dei pulsanti

source: <ul><li><b>Apply</b>: when some packages are selected for installing or updating or deselected for uninstalling this button runs the transaction to be performed.</li>
it: <ul><li><b>Applica</b>: quando dei pacchetti sono selezionati per installazione, aggiornamento o deselezionati per essere disinstallati, questo pulsante permette di eseguire la transazione.</li>

source: <li><b>Select all</b>: if packages are filtered for updates only this button allows to select all the packages in one shot.</li>
it: <li><b>Seleziona tutto</b>: se i pacchetti sono filtrati per mostrare solo gli aggiornamenti questo pulsante permette di selezionare tutti i pacchetti in un colpo solo.</li>

source: <li><b>Quit</b>: exits from dnfdragora.</li></ul>
it: <li><b>Termina</b>: esce da dnfdragora.</li></ul>

source: Downloading : %(files)d files, %(size)d bytes
it: Scaricando : %(files)d file, %(size)d byte

source: Starting to download : %s
it: Inizio a scaricare : %s

source: Progress files (%(downloaded)d/%(total)d)
it: Progresso file (%(downloaded)d/%(total)d)

source: Update information
it: Informazioni sull'aggiornamento

source: File list
it: Lista dei file

source: Requirements
it: Requisiti

source: Software Management - dnfdragora
it: Gestione Software - dnfdragora

source: Summary
it: Sommario

source: Version
it: Versione

source: Status
it: Stato

source: Installed
it: Installato

source: Not installed
it: Non installato

source: To update
it: Da aggiornare

source: Show %s and noarch only
it: Mostra solo %s e noarch

source: Groups
it: Gruppi

source: in names
it: nei nomi

source: in descriptions
it: nelle descrizioni

source: in summaries
it: nei sommari

source: in file names
it: nei nomi dei file

source: Use regexp
it: Usa regexp

source: &Search
it: &Ricerca

source: &Clear search
it: &Pulisci la ricerca

source: Sel&ect all
it: Seleziona &tutti

source: &Quit
it: &Termina

source: Reset the selection
it: Resetta la selezione

source: Refresh Metadata
it: Aggiorna i meta-dati

source: Repositories
it: Repository

source: &Information
it: &Informazioni

source: &History
it: Sto&ria

source: &Options
it: &Opzioni

source: User preferences
it: Preferenze utente

source: &Help
it: &Aiuto

source: Manual
it: Manuale

source: &About
it: &Informazioni su

source: update
it: da aggiornare

source: locked
it: bloccato

source: installed
it: Installato

source: Missing information
it: Informazioni mancanti

source: Refreshing Repository Metadata
it: Aggiornando i meta-dati del repository

source: Package %s cannot be removed
it: Il pacchetto %s non può essere rimosso

source: Protected package selected
it: È stato selezionato un pacchetto protetto

source: Unmanaged widget
it: Widget non gestita

source: Unmanaged event %d
it: Evento %d non gestito

source: Start transaction
it: Inizio transazione

source: Downloading packages
it: Scaricando i pacchetti

source: Checking package signatures
it: Controllando la firma dei pacchetti

source: Applying changes to the system
it: Applicando i cambiamenti al sistema

source: Verify changes on the system
it: Verifica dei cambiamenti al sistema

source: Build transaction
it: Costruzione della transazione

source: Unknown action %(action)s on %(name)s
it: Azione %(action)s non nota su %(name)s

source: Downloading %(count_files)d files (%(count_bytes)sB)...
it: Scaricando %(count_files)d file (%(count_bytes)sB)...

source: Caching updates
it: Creazione della cache degli aggiornamenti

source: Caching installed
it: Creazione della cache dei pacchetti installati

source: Caching available
it: Creazione della cache dei pacchetti disponibili

source: Creating packages cache
it: Creazione della cache dei pacchetti

source: Build Transaction error
it: Errore nella costruzione della transazione

source: GPG key missing
it: Chiave GPG mancante

source: Search error using regular expression
it: Errore nella ricerca usando le espressioni regolari

source: Error starting dnfdaemon service: [%s]
it: Errore nel fare partire il servizio dnfdaemon: [%s]

source: Update
it: Aggiorna

source: Open dnfdragora dialog
it: Apri dnfdragora

source: Check for updates
it: Controlla gli aggiornamenti

source: Exit
it: Termina

source: Running dnfdragora failure
it: Fallimento nel tentativo di eseguire dnfdragora

source: Exception caught: [%s]
it: Catturata eccezione: [%s]

source: %d updates available.
it: Disponibili %d aggiornamenti.

source: No updates available
it: Nessun aggiornamento disponibile

source: A frontend for DNF using libyui UI abstraction library
it: Un front-end a DNF che utilizza la libreria libyui per l'astrazione della UI

source: dnfdragora is a DNF frontend, inspired by rpmdragora from Mageia (originally rpmdrake).
it: dnfdragora è un front-end a DNF ispirato ad rpmdragora da Mageia (in origine rpmdrake).

source: dnfdragora is written in Python 3 and uses libYui, the widget abstraction library written by SUSE, so that it can be run using Qt 5, GTK+ 3, or ncurses interfaces. It provides a frontend for the DNF package manager that can be used in any kind of system environment.
it: dnfdragora è scritto in Python 3 ed usa libYui, la libreria che astrae i widget scritta da SUSE in modo tale che possa essere eseguito usando le interfacce grafiche Qt 5, Gtk+ 3 o ncurses. Fornisce un front-end al gestore dei pacchetti DNF che può essere utilizzato in ogni tipo di ambiente di sistema.
